---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.IsValidFixedNumberOfPoints(System.Int32)
source: html/b5f78696-94a1-e7f7-1f8d-90312956f2ff.htm
---
# Autodesk.Revit.DB.DividedPath.IsValidFixedNumberOfPoints Method

Identifies if the indicated number of points is valid for assignment
 to a DividedPath with a layout type 'FixedNumber'.

## Syntax (C#)
```csharp
public static bool IsValidFixedNumberOfPoints(
	int fixedNumberOfPoints
)
```

## Parameters
- **fixedNumberOfPoints** (`System.Int32`)